bluebandit21/magic-wifi/dev/driverlib/MSP430FR2xx_4xx/cs.c
    // Enable DCO frequency trim
    HWREG16(CS_BASE + OFS_CSCTL1) |= DCOFTRIMEN;

    // Calculates DCO frequency trim values and stores them in struct pointer
    param->fsystem = fsystem;
    privateCSComputeDCOFTrim(param);
    
    while ((HWREG16(CS_BASE + OFS_CSCTL7) & (FLLUNLOCK0 | FLLUNLOCK1)) ||
        (HWREG8(CS_BASE + OFS_CSCTL7_L) & DCOFFG))
    {
        //Clear OSC fault flags
        HWREG8(CS_BASE + OFS_CSCTL7_L) &= ~(DCOFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    // Restore previous SCG0
    __bis_SR_register(srRegisterState);
    
    while (x--)
    {
        __delay_cycles(30);
    }
    // Reapply Oscillator Fault Interrupt Enable if needed
    HWREG8(SFR_BASE + OFS_SFRIE1_L) |= sfr_ofie_status;
    
    return status;
}

bool CS_initFLLLoadTrim(uint16_t fsystem,
    uint16_t ratio,
    CS_initFLLParam *param
    )
{
    if(param->fsystem != fsystem)
    {
        // Protection against wrong clock frequency and trim combination
        return false;
    }
    
    uint16_t dco_FLLN, dco_FLLD = FLLD__1;
    bool status = true;
    volatile uint16_t x = ratio * 32;

    //Save actual state of FLL loop control, then disable it. This is needed to
    //prevent the FLL from acting as we are making fundamental modifications to
    //the clock setup.
    uint16_t srRegisterState = __get_SR_register() & SCG0;

    //Do not want the Oscillator Fault Flag to trigger during this routine.
    //So disable interrupt, save the state, and reapply later if necessary.
    uint8_t sfr_ofie_status = HWREG8(SFR_BASE + OFS_SFRIE1_L) & OFIE;
    HWREG8(SFR_BASE + OFS_SFRIE1_L) &= ~(OFIE);

    //Have at least a divider of 2
    dco_FLLN = ratio;
    
    // Disable FLL
    __bis_SR_register(SCG0);
    
    //Set DCO to proper tap
    HWREG16(CS_BASE + OFS_CSCTL0) &= ~( DCO8 |
                                            DCO7 |
                                            DCO6 |
                                            DCO5 |
                                            DCO4 |
                                            DCO3 |
                                            DCO2 |
                                            DCO1 |
                                            DCO0
                                            );
    HWREG16(CS_BASE + OFS_CSCTL0) |= (param->csCtl0 &
                                        (   DCO8 |
                                            DCO7 |
                                            DCO6 |
                                            DCO5 |
                                            DCO4 |
                                            DCO3 |
                                            DCO2 |
                                            DCO1 |
                                            DCO0
                                            ));

    //Reset FLLN bits
    HWREG16(CS_BASE + OFS_CSCTL2) &= ~( FLLN9 |
                                            FLLN8 |
                                            FLLN7 |
                                            FLLN6 |
                                            FLLN5 |
                                            FLLN4 |
                                            FLLN3 |
                                            FLLN2 |
                                            FLLN1 |
                                            FLLN0
                                        );
    HWREG16(CS_BASE + OFS_CSCTL2) = dco_FLLD | (dco_FLLN - 1);
    
    // Set proper DCORSEL value
    HWREG8(CS_BASE + OFS_CSCTL1) &= ~DCORSEL_7;
    if (fsystem <= 1500) {            //fsystem <= 1.5MHz
        HWREG8(CS_BASE + OFS_CSCTL1) |= DCORSEL_0;
    }
    else if (fsystem <=  3000) {      //1.5MHz < fsystem <= 3MHz
        HWREG8(CS_BASE + OFS_CSCTL1) |= DCORSEL_1;
    }
    else if (fsystem <=  6000) {      //3MHz < fsystem <= 6MHz
        HWREG8(CS_BASE + OFS_CSCTL1) |= DCORSEL_2;
    }
    else if (fsystem <=  10000) {     //6MHz < fsystem <= 10MHz
        HWREG8(CS_BASE + OFS_CSCTL1) |= DCORSEL_3;
    }
    else if (fsystem <=  14000) {     //10MHz < fsystem <= 14MHz
        HWREG8(CS_BASE + OFS_CSCTL1) |= DCORSEL_4;
    }
    else if (fsystem <=  18000) {     //14MHz < fsystem <= 18MHz
        HWREG8(CS_BASE + OFS_CSCTL1) |= DCORSEL_5;
    }
    else if (fsystem <=  22000) {     //18MHz < fsystem <= 22MHz
        HWREG8(CS_BASE + OFS_CSCTL1) |= DCORSEL_6;
    }
    else if (fsystem <=  24000) {     //22MHz < fsystem <= 24MHz
        HWREG8(CS_BASE + OFS_CSCTL1) |= DCORSEL_7;
    }
    else {
        //exceeds 24MHz, not supported
        status = false;
    }
    
    // Enable DCO frequency trim
    HWREG16(CS_BASE + OFS_CSCTL1) |= DCOFTRIMEN;
    
    // Set proper DCOFTRIM value
    HWREG16(CS_BASE + OFS_CSCTL1) &= ~(DCOFTRIM0 | DCOFTRIM1 | DCOFTRIM2);
    HWREG16(CS_BASE + OFS_CSCTL1) |= (param->csCtl1 & (DCOFTRIM0 | DCOFTRIM1 | DCOFTRIM2));

    // Re-enable FLL
    __bic_SR_register(SCG0);
    
    while ((HWREG16(CS_BASE + OFS_CSCTL7) & (FLLUNLOCK0 | FLLUNLOCK1)) ||
        (HWREG8(CS_BASE + OFS_CSCTL7_L) & DCOFFG))
    {
        //Clear OSC fault flags
        HWREG8(CS_BASE + OFS_CSCTL7_L) &= ~(DCOFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    // Restore previous SCG0
    __bis_SR_register(srRegisterState);
    
    while (x--)
    {
        __delay_cycles(30);
    }
    // Reapply Oscillator Fault Interrupt Enable if needed
    HWREG8(SFR_BASE + OFS_SFRIE1_L) |= sfr_ofie_status;
    
    return status;
}

void CS_enableClockRequest(uint8_t selectClock
    )
{
    HWREG8(CS_BASE + OFS_CSCTL8) |= selectClock;
}

void CS_disableClockRequest(uint8_t selectClock
    )
{
    HWREG8(CS_BASE + OFS_CSCTL8) &= ~selectClock;
}

uint8_t CS_getFaultFlagStatus(uint8_t mask
    )
{
    return (HWREG8(CS_BASE + OFS_CSCTL7) & mask);
}

void CS_clearFaultFlag(uint8_t mask
    )
{
    HWREG8(CS_BASE + OFS_CSCTL7) &= ~mask;
}

