bluebandit21/magic-wifi/dev/driverlib/MSP430FR2xx_4xx/cs.c
uint32_t CS_getACLK(void)
{
    //Find ACLK source
    uint16_t ACLKSource = (HWREG16(CS_BASE + OFS_CSCTL4) & SELA);

    ACLKSource = ACLKSource >> 8;

    if (ACLKSource == 0x0) {
        ACLKSource = SELMS__XT1CLK;
    }
    else if (ACLKSource == 0x1) {
        ACLKSource = SELMS__REFOCLK;
    }
    else {
        ACLKSource = SELMS__VLOCLK;
    }

    uint16_t ACLKSourceDivider = 0;
#ifdef DIVA0
    if (HWREG16(CS_BASE + OFS_CSCTL6) & XTS) {

        uint16_t div = (HWREG16(CS_BASE + OFS_CSCTL6) &
                (DIVA0|DIVA1|DIVA2|DIVA3)) >>8;
        switch(div) {
        case 1:
        case 2:
        case 3:
        case 4:
        case 5:
            ACLKSourceDivider = 8*(1<<div);
            break;
        case 6:
            ACLKSourceDivider = 384;
            break;
        case 7:
            ACLKSourceDivider = 512;
            break;
        case 8:
            ACLKSourceDivider = 768;
            break;
        case 9:
            ACLKSourceDivider = 1024;
            break;
        case 10:
            ACLKSourceDivider = 108;
            break;
        case 11:
            ACLKSourceDivider = 338;
            break;
        case 12:
            ACLKSourceDivider = 414;
            break;
        case 13:
            ACLKSourceDivider = 640;
            break;
        default:
            break;
        }
    }
#endif
    return (privateCSComputeCLKFrequency(
            ACLKSource,
            ACLKSourceDivider,
            CS_ACLK)
            );
}

uint32_t CS_getSMCLK(void)
{
    uint16_t SMCLKSource = HWREG8(CS_BASE + OFS_CSCTL4_L) & SELMS_7;

    uint16_t SMCLKSourceDivider =
        HWREG16(CS_BASE + OFS_CSCTL5) & DIVS_3;
    SMCLKSourceDivider = SMCLKSourceDivider >> 4;

    return (privateCSComputeCLKFrequency(
                SMCLKSource,
                SMCLKSourceDivider,
                CS_SMCLK)
            );
}

uint32_t CS_getMCLK(void)
{
    //Find AMCLK source
    uint16_t MCLKSource = (HWREG16(CS_BASE + OFS_CSCTL4) & SELMS_7);

    uint16_t MCLKSourceDivider =  HWREG16(CS_BASE + OFS_CSCTL5) & DIVM_7;

    return (privateCSComputeCLKFrequency(
                MCLKSource,
                MCLKSourceDivider,
                CS_MCLK)
            );
}

uint16_t CS_clearAllOscFlagsWithTimeout( uint16_t timeout){
    do {
      // Clear all osc fault flags
      HWREG8(CS_BASE + OFS_CSCTL7) &= ~(DCOFFG | XT1OFFG);

      // Clear the global osc fault flag.
      HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
      
      // Check XT1 fault flags
    } while ((HWREG8(SFR_BASE + OFS_SFRIFG1) & OFIFG) && --timeout);

    return (HWREG8(CS_BASE + OFS_CSCTL7) & (DCOFFG | XT1OFFG));
}

void CS_enableXT1AutomaticGainControl(void)
{
    HWREG16(CS_BASE + OFS_CSCTL6) &= ~XT1AGCOFF;
}

void CS_disableXT1AutomaticGainControl(void)
{
    HWREG16(CS_BASE + OFS_CSCTL6) |= XT1AGCOFF;
}

void CS_enableFLLUnlock(void)
{
    HWREG16(CS_BASE + OFS_CSCTL7) |= FLLULPUC;
}

void CS_disableFLLUnlock(void)
{
    HWREG16(CS_BASE + OFS_CSCTL7) &= ~FLLULPUC;
}

void CS_enableREFOLP(void)
{
#ifdef REFOLP
    HWREG16(CS_BASE + OFS_CSCTL3) |= REFOLP;
#endif
}

void CS_disableREFOLP(void)
{
#ifdef REFOLP
    HWREG16(CS_BASE + OFS_CSCTL3) &= ~REFOLP;
#endif
}

bool CS_getREFOLP(void)
{
#ifdef REFOLP
    return ((HWREG16(CS_BASE + OFS_CSCTL3) & REFOLP) ? true : false);
#else
    return false;
#endif
}

void CS_enableXT1FaultOff(void)
{
#ifdef XT1FAULTOFF
    HWREG16(CS_BASE + OFS_CSCTL6) |= XT1FAULTOFF;
#endif
}

void CS_disableXT1FaultOff(void)
{
#ifdef XT1FAULTOFF
    HWREG16(CS_BASE + OFS_CSCTL6) &= ~XT1FAULTOFF;
#endif
}

bool CS_getXT1FaultOff(void)
{
#ifdef XT1FAULTOFF
    return ((HWREG16(CS_BASE + OFS_CSCTL6) & XT1FAULTOFF) ? true : false);
#else
    return false;
#endif
}

bool CS_getREFOReady(void)
{
#ifdef REFOREADY
    return ((HWREG16(CS_BASE + OFS_CSCTL7) & REFOREADY) ? true : false);
#else
    return false;
#endif
}

#endif
//*****************************************************************************
//
//! Close the doxygen group for cs_api
//! @}
//
//*****************************************************************************
